[
  {
    "id": 2,
    "image": "https://i.ibb.co.com/Jzn54N3/Sushi-Platter-08.jpg",
    "headline": "Pastaria Hotel and Restaurant",
    "description": "The Pastaria Hotel and Restaurant Management Website is a full-stack application developed using the MERN stack (MongoDB, Express.js, React.js, and Node.js). This project aims to enhance customer engagement with features like online reservations and ordering while streamlining internal operations, including staff and order management, to improve overall efficiency and user experience. The purpose of the Pastaria Hotel and Restaurant Management Website is to enhance customer engagement through a user-friendly platform while optimizing internal operations like staff and order management for improved efficiency and service quality.",
    "github": "https://github.com/ahasan2912/restaurant-management-system-client",
    "sitelink": "https://restaurant-management-68f5d.firebaseapp.com/"
  },
  {
    "id": 1,
    "image": "https://i.ibb.co.com/C61yfzn/dragon-news.jpg",
    "headline": "Career Counseling",
    "description": "The career counseling project is a web platform that provides personalized career recommendations, resources, and tools. It features secure authentication and responsive design for a seamless experience across devices, empowering users with insights and advice to guide their professional decisions.",
    "github": "https://github.com/ahasan2912/career-cousnseling-react",
    "sitelink": "https://career-counseling2912-a9.netlify.app/"
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/fFyVscy/dell-2619501-640.jpg",
    "headline": "Gadget-Zone e-commerce",
    "description": "Gadget-Zone is an e-commerce platform for gadget enthusiasts, offering products like laptops, smartphones, and accessories. It features detailed product pages, a shopping cart, wishlist, and filtering options. Built with React, Tailwind CSS, and Context API, ensuring smooth navigation and data persistence.",
    "github": "https://github.com/ahasan2912/gadget-zone-react-router",
    "sitelink": "https://gadzet-zone-website-b10-a8.netlify.app/"
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/98rRFR4/Tennis-Balls.jpg",
    "headline": "Online Sports Store",
    "description": "The Sports Accessories Online Store is a responsive e-commerce platform designed to provide customers with an efficient and user-friendly shopping experience for a wide range of sports equipment and apparel. The website offers features such as intuitive browsing, secure user authentication, and detailed product reviews. It caters to various sports disciplines, ensuring accessibility for enthusiasts and professionals alike. The platform also includes robust product management, allowing seamless inventory updates. With a focus on functionality and design, the store ensures a responsive and engaging experience across all devices, aiming to meet the needs of sports enthusiasts worldwide.",
    "sitelink": "https://sport-equipment-store2912.netlify.app/"
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/W5pmFB7/cricket-724615-640.jpg",
    "headline": "Bpl team draft",
    "description": "The BPL Team Draft is a platform for managing fantasy cricket teams for the Bangladesh Premier League. Users can browse player profiles, select players, and view key details. Built with React and Tailwind CSS, it offers smooth navigation and team management features.",
    "github": "https://github.com/ahasan2912/bpl-team-draft-react",
    "sitelink": "https://bpl-team-draft-b10-a7.netlify.app/"
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/W6Vkj4q/animal-6815808-640.jpg",
    "headline": "All things animal",
    "description": "All Things Animal is a website offering detailed information about animals like dogs, cats, rabbits, and birds. It provides profiles, care tips, and interesting facts, enhancing user experience with filters and images. The platform serves as an educational resource for animal enthusiasts.",
    "github": "https://github.com/ahasan2912/all-things-animal-b6-a10",
    "sitelink": "https://all-things-animal-b10-a6.netlify.app/"
  }
]