[
    {
      "id": 1,
      "image": "https://i.ibb.co.com/C61yfzn/dragon-news.jpg",
      "headline": "Career Counseling",
      "description": "The career counseling project is a web platform that provides personalized career recommendations, resources, and tools. It features secure authentication and responsive design for a seamless experience across devices, empowering users with insights and advice to guide their professional decisions.",
      "github": "https://github.com/ahasan2912/career-cousnseling-react",
      "sitelink": "https://career-counseling2912-a9.netlify.app/"
    },
    {
      "id": 2,
      "image": "https://i.ibb.co.com/BrBDcL5/live-media-program-news-presenter-reveals-remarkable-finding-biologists-found-new-type-dinosaur-anta.jpg",
      "headline": "Dragon New Authentication",
      "description": "The Dragon News authentication system allows secure user access, offering account creation, login, and personalized content. It integrates Firebase for protection and supports social logins (Google/Facebook), ensuring data security and allowing only authorized users to interact with the platform.",
      "github": "https://github.com/ahasan2912/dragon-news-authentication",
      "sitelink": "https://moha-milon-practices-project.web.app/category/01"
    },
    {
      "id": 3,
      "image": "https://i.ibb.co.com/fFyVscy/dell-2619501-640.jpg",
      "headline": "Gadget-Zone e-commerce",
      "description": "Gadget-Zone is an e-commerce platform for gadget enthusiasts, offering products like laptops, smartphones, and accessories. It features detailed product pages, a shopping cart, wishlist, and filtering options. Built with React, Tailwind CSS, and Context API, ensuring smooth navigation and data persistence.",
      "github": "https://github.com/ahasan2912/gadget-zone-react-router",
      "sitelink": "https://gadzet-zone-website-b10-a8.netlify.app/"
    },
    {
      "id": 4,
      "image": "https://i.ibb.co.com/gMCfTYY/coffeebook.jpg",
      "headline": "CoffeBook website",
      "description": "CoffeeBook is a vibrant website for coffee lovers, offering recipes, brewing techniques, and insights into coffee varieties. Built with React and Tailwind CSS, it features search, bookmarking, user authentication, and educational content, creating a community for coffee enthusiasts.",
      "github": "https://github.com/ahasan2912/coffee-book-react-router",
      "sitelink": "https://aesthetic-naiad-4a8a0b.netlify.app/"
    },
    {
      "id": 5,
      "image": "https://i.ibb.co.com/W5pmFB7/cricket-724615-640.jpg",
      "headline": "Bpl team draft",
      "description": "The BPL Team Draft is a platform for managing fantasy cricket teams for the Bangladesh Premier League. Users can browse player profiles, select players, and view key details. Built with React and Tailwind CSS, it offers smooth navigation and team management features.",
      "github": "https://github.com/ahasan2912/bpl-team-draft-react",
      "sitelink": "https://bpl-team-draft-b10-a7.netlify.app/"
    },
    {
      "id": 6,
      "image": "https://i.ibb.co.com/W6Vkj4q/animal-6815808-640.jpg",
      "headline": "All things animal",
      "description": "All Things Animal is a website offering detailed information about animals like dogs, cats, rabbits, and birds. It provides profiles, care tips, and interesting facts, enhancing user experience with filters and images. The platform serves as an educational resource for animal enthusiasts.",
      "github": "https://github.com/ahasan2912/all-things-animal-b6-a10",
      "sitelink": "https://all-things-animal-b10-a6.netlify.app/"
    }
  ]
  